app/controllers/sponsors_controller.rb

  def index
    @sponsors = Sponsor.order(:name)
---
SELECT "sponsors".* FROM "sponsors"  ORDER BY "sponsors"."name" ASC

  def show
    @sponsor = Sponsor.find(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT 1  [["id", 1]]

  def create
     @sponsor = Sponsor.new(sponsor_params)

    if @sponsor.save
---
INSERT INTO "sponsors" ("name", "description", "spn_type", "link_to_sec", "link_to_sponsor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @sponsor = Sponsor.find(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @sponsor = Sponsor.find(params[:id])

    if @sponsor.update_attributes(sponsor_params)
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "sponsors" SET "link_to_sponsor" = ?, "updated_at" = ? WHERE "sponsors"."id" = ?  [["link_to_sponsor", "http://www.sponsor1.commmmmmmmmmmmmmmmmm"], ["updated_at", "2017-03-26 00:20:10.920483"], ["id", 1]]

  def delete
    @sponsor = Sponsor.find(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT 1  [["id", 3]]

  def destroy
    @sponsor = Sponsor.find(params[:id])
    @sponsor.destroy
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "sponsors" WHERE "sponsors"."id" = ?  [["id", 3]]